anthropic.claude-code
batisteo.vscode-django
charliermarsh.ruff
christian-kohler.path-intellisense
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
github.codespaces
github.copilot-chat
google.gemini-cli-vscode-ide-companion
inci-august.august-themes
jdinhlife.gruvbox
kacperbiedka.one-candy-dark
kevinrose.vsc-python-indent
magicstack.magicpython
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
njpwerner.autodocstring
openai.chatgpt
pomdtr.excalidraw-editor
qufiwefefwoyn.kanagawa
ritwickdey.liveserver
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-russian
thang-nm.flow-icons
wix.vscode-import-cost
yy0931.vscode-sqlite3-editor
